{
    "id": "EI17",
    "registered": 2,
    "eName": "CSIR UGC NET",
    "tName": "Life Science",
    "title": "CSIR Life Science Mock Test",
    "about": "CSIR NET JRF Mock Test",
    "description":"We are excited to offer you our CSIR UGC NET JRF Life Science Mock Test course. This course is specifically designed to help you prepare for the CSIR UGC NET JRF Life Science exam and enhance your chances of success. \n\n ## Course Features \n\n - **Unlimited Attempts**:Our course allows you to attempt the mock tests as many times as you need. This feature enables you to practice and improve your skills until you feel confident and ready for the actual exam. \n\n - **Chapterwise Coverage**:The mock tests in this course are structured chapterwise, covering all the important topics and chapters of the CSIR UGC NET JRF Life Science syllabus. This approach allows you to focus on specific areas of the subject and strengthen your understanding accordingly. \n\n - **Previous Year Papers**:In addition to chapterwise coverage, our mock tests also include previous year papers. These papers provide you with insights into the types of questions that have been asked in previous exams, helping you identify recurring patterns and important topics. \n\n - **Sample Papers**:To further enhance your preparation, we have included sample papers in our mock tests. These papers are designed to simulate the actual exam conditions and provide you with a realistic exam experience. Practicing with sample papers will help you familiarize yourself with the question format and improve your time management skills. \n\n We are committed to supporting you in your journey towards achieving your goals and excelling in the CSIR UGC NET JRF Life Science exam. Enroll now and take the first step towards success! \n",
    "price": 100,
    "rating": 4,
    "bestSeller": false,
    "language": ["English"],
    "tests": [
        ["Cell Biology and Cell Division", 60, 60],
        ["Genetics and Evolution", 60, 60],
        ["Biological Chemistry", 60, 60],
        ["Bioenergetics and Metabolism", 60, 60],
        ["Molecular Biology and Recombinant DNA Technology", 60, 60],
        ["Microbiology and Immunology", 60, 60],
        ["Physiology - Animal and Plant", 60, 60],
        ["Ecology and Environmental Science", 60, 60],
        ["Developmental Biology", 60, 60], 
        ["Biotechnology and its Applications", 60, 60], 
        ["Techniques in Life Sciences", 60, 60], 
        ["Plant and Animal Physiology", 60, 60], 
        ["Bioinformatics and Computational Biology", 60, 60], 
        ["Human Physiology", 60, 60], 
        ["Genetics in Human Welfare", 60, 60], 
        ["Sample Mock Test 01", 60, 60], 
        ["Sample Mock Test 02", 60, 60], 
        ["CSIR LS 2016 Paper", 50, 60],
        ["CSIR LS 2017 Paper", 50, 60],
        ["CSIR LS 2018 Paper", 60, 60],
        ["CSIR LS 2019 Paper", 60, 60],
        ["CSIR LS 2020 Paper", 60, 60],
        ["CSIR LS 2021 Paper", 60, 60],
        ["CSIR LS 2022 Paper", 60, 60],
        ["CSIR LS 2023 Paper", 60, 60]
    ]
}