{
    "id": "EI6",
    "registered": 12,
    "eName": "ICAR-JRF",
    "tName": "Plant Science",
    "title": "Plant Science",
    "about": "Plant science basics",
    "description": "National Testing Agency (NTA) conducts every year entrance examination of ICAR JRF Plant Sciences. Students who are preparing for the ICAR JRF Plant Sciences Entrance Exam 2023 should know about the syllabus. Get the Syllabus of ICAR AIEEA PG Plant Sciences 2023. The syllabus of ICAR JRF Plant Sciences is downloaded from the official site of ICAR.\n\nThe ICAR JRF Plant Sciences Entrance Exam 2023 tests the candidate's knowledge and understanding of various subjects within the field of Plant Science. The subjects included in the ICAR JRF Plant Sciences exam are Plant Breeding & Genetics, Plant Pathology, Agricultural Microbiology/Microbiology, Seed Science & Technology, and Plant Genetic Resources. Each subject covers various theories and concepts related to the growth and development of plants, plant health, and the preservation of plant genetic resources. It is important for the candidates to have a comprehensive understanding of these subjects in order to perform well in the ICAR JRF Plant Sciences Entrance Exam.\n\n**Subjects in ICAR JRF Plant Sciences**\n\n- Plant Breeding & Genetics\n\n- Plant Pathology\n\n- Agricultural Microbiology/Microbiology\n\n- Seed Science & Technology\n\n- Plant Genetic Resources\n\n**UNIT-I:**\n\nImportance of Agriculture in the national economy; basic principles of crop production; cultivation of rice, wheat, chickpea, pigeon-pea, sugarcane, groundnut, tomato, potato, and mango. Major soils of India, the role of NPK and their deficiency symptoms.\n\n**UNIT-II:**\n\nStructure and function of cell organelles; mitosis and meiosis; Mendelian genetics; elementary knowledge of photosynthesis; respiration, and transpiration; structure and functions of carbohydrates, proteins, nucleic acids, enzymes, and vitamins. Major pests and diseases of rice, wheat, cotton, chickpea, and sugarcane and their management.\n\n**UNIT-III:**\n\nCharacteristics of prokaryotic and eukaryotic organisms, differences between fungi, bacteria, mycoplasma, and viruses; physical and chemical basis of heredity; chromosome structure; genes/operon concept; protein biosynthesis; transformation, recombination, Heterosis; Elements of economic botany; integrated diseases management; sterilization, disinfection, and pasteurization; Koch's postulates; etiological agents of rusts, smuts, powdery/downy mildew, wilts, yellows, mosaic, necrosis, enations, blights and witches- broom; pH, buffer, vitamins, the role of plant hormones in seed germination and dormancy; pollination/ fertilization in flowering plants; methods of seed testing; breeders, foundation and certified seeds; seed production in self and cross-pollinated crops, nitrate assimilation; biological nitrogen fixation and other uses of microorganisms in agriculture.\n\n**UNIT-IV:**\n\nFood and industry; composting and biogas production. Important rural development programs in India; organizational set up of agricultural research, education, and extension in India.",
    "price": 50,
    "rating": 5,
    "bestSeller": false,
    "language": ["English"],
    "tests": [
        ["Level 1", 50, 50]
    ]
}