{
    "id": "EI16",
    "registered": 62,
    "eName": "IBPS",
    "tName": "Agriculture Field Officer",
    "title": "IBPS AFO MOCK TEST",
    "about": "Agriculture Field Officer",
    "description": "# IBPS AFO Mock Test \n We are excited to offer you our IBPS AFO Mock Test course, designed to help you prepare for the real exam and enhance your chances of success.\n\n ## Course Features \n\n - **Unlimited Attempts**:Our course features unlimited attempts, allowing you to practice as many times as you need to improve your skills and confidence. \n\n - **Comprehensive Question Bank**:With over 1000 carefully curated questions, you will have ample opportunities to familiarize yourself with the exam format and content. \n\n - **Real Exam-Like Simulation**:We provide a real exam-like simulation, ensuring that our mock tests accurately reflect the difficulty level and structure of the actual IBPS AFO exam.\n\n - **Sample Mock Tests**:In addition to the comprehensive question bank, we also offer sample mock tests that cover different sections of the exam. These tests will enable you to assess your strengths and weaknesses in each area and focus your study efforts accordingly. \n\n - **Previous Year Questions**:To further enhance your preparation, we include previous year questions in our mock tests. This allows you to gain insights into the types of questions that have been asked in previous exams, helping you identify recurring patterns and important topics. \n\n - **User-Friendly Online Platform**:Our online platform provides a user-friendly interface, making it easy for you to navigate through the course materials and attempt the mock tests. You can access the course anytime and anywhere, allowing you to study at your own pace and convenience. \n\n ## Start Your Preparation Today \n\n By participating in our IBPS AFO Mock Test course, you will be well-equipped to tackle the actual exam with confidence. Our goal is to help you succeed in your professional journey and open doors to new opportunities. \n\n **Note**: Please be aware that all previous year papers included in our IBPS AFO Mock Test course are memory-based and may not exactly match the questions that will appear in the actual exam. While these papers are designed to provide you with a comprehensive understanding of the exam pattern and content, they should not be considered as an exact representation of the actual paper. It is advisable to refer to official resources and study materials provided by the conducting body for the most accurate and up-to-date information regarding the IBPS AFO exam.",
    "price": 50,
    "rating": 4.5,
    "bestSeller": false,
    "language": ["English"],
    "tests": [
        ["Sample Mock Test 01", 60, 45],
        ["Sample Mock Test 02", 60, 45],
        ["Sample Mock Test 03", 60, 45],
        ["Sample Mock Test 04", 60, 45],
        ["Sample Mock Test 05", 60, 45],
        ["Sample Mock Test 06", 60, 45],
        ["Sample Mock Test 07", 60, 45],
        ["Sample Mock Test 08", 60, 45],
        ["Sample Mock Test 09", 60, 45],
        ["Sample Mock Test 10", 60, 45],
        ["IBPS AFO 2012 Paper", 50, 45],
        ["IBPS AFO 2013 Paper", 50, 45],
        ["IBPS AFO 2014 Paper", 50, 45],
        ["IBPS AFO 2015 Paper", 50, 45],
        ["IBPS AFO 2016 Paper", 50, 45],
        ["IBPS AFO 2017 Paper", 50, 45],
        ["IBPS AFO 2018 Paper", 60, 45],
        ["IBPS AFO 2019 Paper", 57, 45],
        ["IBPS AFO 2020 Paper", 60, 45],
        ["IBPS AFO 2021 Paper", 60, 45],
        ["IBPS AFO 2022 Paper", 60, 45],
        ["IBPS AFO 2023 Paper", 60, 45]
    ]
}