{
    "id": "EI15",
    "registered": 12,
    "eName": "ICAR-AIEEA-PG",
    "tName": "Plant Pathology",
    "title": "Plant Pathology",
    "about": "For ICAR JRF SRF Aspirants",
    "description": "### Mock Test of Plant Pathology\n The mock test of plant pathology is a comprehensive multiple-choice question (MCQ) assessment designed to evaluate your knowledge and understanding of various aspects of plant diseases and their management. This test is specifically tailored for students and professionals in the field of plant pathology, including plant scientists, agronomists, horticulturists, and crop consultants.\n ### Test Coverage \n The test will cover a wide range of topics, including:\n - Identification and classification of plant diseases\n - Causes and symptoms of common plant pathogens\n - Principles of disease development and spread\n - Methods and strategies used in disease control and management \n ### Benefits for ICAR JRF and Other Entrance Exams \n The mock test of plant pathology is highly beneficial for those preparing for ICAR JRF (Indian Council of Agricultural Research Junior Research Fellowship) and other entrance exams in the field of plant pathology. These exams typically assess candidates' knowledge and understanding of various aspects of plant diseases and their management. \n By taking this mock test, you will: \n - Gain practice and familiarity with the types of questions commonly asked in these entrance exams\n - Develop critical thinking and problem-solving skills\n - Improve your ability to recall and apply knowledge effectively\n - Thoroughly cover the relevant topics tested in ICAR JRF and other entrance exams \n ### Assessment and Preparation \n The mock test will consist of a series of multiple-choice questions (MCQs) that will challenge your understanding and application of plant pathology concepts. By thoroughly studying and preparing for this mock test, you will be better equipped to handle the specific content and format of the ICAR JRF and other entrance exams. \n Additionally, the mock test will provide a realistic assessment of your preparedness and readiness for these exams. It will help you identify areas where further study or improvement is needed, allowing you to focus your efforts and resources accordingly. \n  Overall, the mock test of plant pathology is an invaluable resource for individuals preparing for ICAR JRF and other entrance exams in the field. It will enhance your understanding, boost your confidence, and increase your chances of success in these competitive assessments.",
    "price": 120,
    "rating": 4,
    "bestSeller": false,
    "language": ["English"],
    "tests": [
        ["History and Contribution", 120, 120],
        ["General Part 1", 120, 120],
        ["General Part 2", 120, 120],
        ["Mycology Part 1", 120, 120],
        ["Mycology Part 2", 120, 120],
        ["Bacteriology Part 1", 120, 120],
        ["Bacteriology Part 2", 120, 120],
        ["Virology Part 1", 120, 120],
        ["Virology Part 2", 120, 120],
        ["Matching Types", 120, 120],
        ["Confusing Types", 120, 120],
        ["Fill in the Blanks Type", 120, 120],
        ["Plant Diseases & Causal Agents", 120, 120],
        ["Vectors", 120, 120],
        ["Sample Paper 1", 120, 120],
        ["Sample Paper 2", 120, 120],
        ["Sample Paper 3", 120, 120],
        ["Sample Paper 4", 120, 120],
        ["2022 Paper", 120, 120]
    ]
}