{
    "id": "EI4",
    "registered": 115,
    "eName": "ICAR-AIEEA-PG",
    "tName": "Social Science",
    "title": "Social Science",
    "about": "Complete Social Sciences",
    "description": "**Features of this test series:**\n\n1. Total 15 test papers were made by me. Each paper contains 120 questions.\n\n2. All the tests are full length tests consisting all syllabus and subjects of social sciences and all follow same pattern.\n\n3. All tests have a fixed proportion of different types of questions from Extension, Economics, General Agriculture and Statistics.\n\n4. Question types include ABCD type, matching type, direct MCQS, statement type, chronology type etc.\n\n**Area covered:**\n\n- **Agricultural Economics**,\n\n- **Dairy Economics**\n\n- **Agriculture Extension/Extension Education/Communication**\n\n- **Dairy Extension Education**\n\nUNIT-I: Importance of Agriculture in national economy; basic principles of crop production; cultivation of rice, wheat, chickpea, pigeon-pea, sugarcane, groundnut, tomato and mango. Major soils of India, role of NPK and their deficiency symptoms. Structure and function of cell organelles, mitosis and meiosis; Mendelian genetics; elementary knowledge of photosynthesis; respiration, and transpiration; structure and functions of carbohydrates, proteins, nucleic acids, enzymes and vitamins. Major pests and diseases of rice, wheat, cotton, chickpea, sugarcane and their management. Important rural development programmes in India; organisational set up of agricultural research, education and extension in India; Elements of statistics. Measures of central tendency and dispersion, regression and correlation; concept of probability, sampling techniques and tests of significance.\n\nUNIT-II: Theory of consumer behaviour, theory of demand, elasticity of demand, indifference curve analysis, theory of firm, cost curves, theory of supply, price determination, market classification, concept of macroeconomics, money and banking, national income. Agricultural marketing---role, practice, institutions, problems and reforms, role of capital and credit in agriculture, crop insurance, credit institutions, cooperatives, capital formation in agriculture, agrarian reforms, globalization, WTO & its impact on Indian agriculture.\n\nUNIT-III: Basic principles of farm management, concept of farming system and economics of farming systems, agricultural production economics-scope and analysis, factor-product relationship, marginal cost and marginal revenue, farm planning and budgeting, Agricultural finance: nature and scope. Time value of money, Compounding and discounting. Agricultural credit: meaning, definition, need, classification. Credit analysis: 4R's, 5C's and 7 P's of credit, repayment plans. History of financing agriculture in India. Commercial banks, nationalization of commercial banks. Lead bank scheme, regional rural banks, scale of finance. Higher financing agencies, RBI, NABARD, AFC, Asian Development Bank, World Bank, role of capital and credit in agriculture; credit institutions, co-operatives and agrarian reforms in India.\n\nUNIT-IV: Extension Education- concept, meaning, principles, philosophy, scope and importance; Extension programme planning and evaluation- steps and principles, models of organizing agricultural extension; historical development of extension in USA, Japan and India. Rural development, meaning, importance and problems; Rural development programmes in India- Pre-independence era to recent ones; Extension teaching methods, definition and concept of sociology, differences between rural & urban communities, social stratification., social groups, social organization and social change. Rural leadership, educational psychology- learning and teaching, role of personality in agricultural extension Indian rural system- its characteristics; value system, cost and class; structure and customs; rural group organization and adult education.\n\nUNIT-V: Communication, principles, concepts, process, elements and barriers in teaching methods. Different kinds of communication methods and media and AV aids/materials. Media mix, Campaign, Cyber extension- internet, cybercafé, Kisan Call Centers, teleconferencing, agriculture journalism, diffusion and adoption of innovations- adopter categories, capacity building of extension personnel and farmers- training to farmers, women and rural youth.\n\nAbout the author:\n\nI am Shubho Paul, currently pursuing M.Sc. 2nd year in ICAR-IARI, New Delhi in Agricultural Economics. **I have secured rank 1st in ICAR-AIEEA (PG)** exam or popularly known as JRF exam in 2021. Any query regarding this test please contact me on shubhopaul113934@gmail.com",
    "price": 50,
    "rating": 4.9,
    "bestSeller": false,
    "language": ["English"],
    "tests": [
        ["Full Syllabus 01", 120, 120]
    ]
}